In [1]:
import numpy as np
import pandas as pd

In [3]:
df=pd.DataFrame({'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]})
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [4]:
df.isnull().sum()

A    1
B    2
C    0
dtype: int64

In [8]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [12]:
df=pd.DataFrame({'A':[1,2,np.nan],
                'H':[5,np.nan,np.nan],
                'age':[16,17,np.nan]})
df

     A    H   age
0  1.0  5.0  16.0
1  2.0  NaN  17.0
2  NaN  NaN   NaN

In [13]:
df.isnull().sum()

A      1
H      2
age    1
dtype: int64

In [14]:
df.dropna()

     A    H   age
0  1.0  5.0  16.0

In [20]:
age10th_class=[16,17,15,16,15,16,15]

In [21]:
np.mean(age10th_class)

15.714285714285714

In [24]:
np.median(age10th_class)

16.0

In [22]:
df.fillna("Male")

      A     H   age
0   1.0   5.0  16.0
1   2.0  Male  17.0
2  Male  Male  Male